{
  "motivationalLines": {
    "taskCreation": [
      "The first step is always the hardest - you just took it!",
      "Progress, not perfection.",
      "Small steps lead to big results.",
      "You've defined the target. Now hit it.",
      "Every expert was once a beginner who didn't quit.",
      "A task written down is halfway done.",
      "You're already ahead of everyone still thinking about it.",
      "The journey of a thousand miles begins with this single step.",
      "Clarity is power. You just gained some.",
      "Your future self will thank you for starting now.",
      "Action beats anxiety every time.",
      "You've turned an idea into a plan. That's powerful.",
      "The hardest part is starting. You just did that.",
      "Momentum begins with a single push.",
      "You're not procrastinating - you're preparing to succeed.",
      "Every accomplishment starts with the decision to try.",
      "You've chosen progress over perfection. Smart move.",
      "The best time to start was yesterday. The next best time is now.",
      "You just turned 'someday' into 'today'.",
      "Focus is a superpower. You're activating it.",
      "One task at a time, one victory at a time.",
      "You're not just planning - you're committing.",
      "This is where transformation begins.",
      "You've moved from thinking to doing. That's rare.",
      "The path to success is now visible.",
      "Intention without action is just a wish. You're taking action.",
      "You're investing in your future right now.",
      "Overthinking stops here. Execution starts now.",
      "You've chosen to be a doer, not just a dreamer.",
      "This task is your bridge from where you are to where you want to be.",
      "Starting is the hardest part. It's behind you now.",
      "You're turning resistance into momentum.",
      "Every master was once a disaster who kept going.",
      "You're not behind - you're exactly where you need to be.",
      "This moment of action is worth hours of planning.",
      "You've chosen growth over comfort.",
      "The timer isn't counting down - it's counting up to your success.",
      "You're stronger than your excuses.",
      "This is you, taking control.",
      "Perfect is the enemy of done. You chose done.",
      "You're writing your success story one task at a time.",
      "Fear of starting is worse than the task itself.",
      "You just proved you're serious about this.",
      "Winners focus on winning. You're focusing.",
      "You're not just busy - you're productive.",
      "This is what showing up looks like.",
      "You're beating procrastination right now.",
      "Every expert started with a single task.",
      "You're turning 'I should' into 'I will'.",
      "The future belongs to those who start today."
    ],
    "sessionStart": [
      "Deep breath. You've got this.",
      "One task, one focus.",
      "Your future self will thank you.",
      "Time to show what you're made of.",
      "Focus mode: activated.",
      "Distractions are no match for your determination.",
      "This is your time. Own it.",
      "Excellence is a habit. You're building it now.",
      "The world can wait. This is your moment.",
      "Breathe. Focus. Execute.",
      "You're exactly where you need to be.",
      "This session will move you forward.",
      "Clear mind, clear goal, clear path.",
      "You're stronger than any distraction.",
      "Time to turn potential into progress.",
      "Your focus is your superpower.",
      "The next 25 minutes will matter.",
      "You're not just working - you're growing.",
      "This is practice for success.",
      "Your attention is your most valuable asset.",
      "Time to surprise yourself.",
      "Focus is the new superpower. Use it.",
      "You're training your brain for greatness.",
      "This session is an investment in yourself.",
      "Complexity becomes simple with focus.",
      "You're about to prove something to yourself.",
      "The timer is your ally, not your enemy.",
      "This is meditation in action.",
      "You're choosing depth over distraction.",
      "Your focus is a form of respect for your goals.",
      "Time to close the gap between intention and action.",
      "You're about to enter your flow state.",
      "This is where discipline becomes freedom.",
      "Your presence here is your power.",
      "Focus isn't about doing more - it's about doing what matters.",
      "You're training for mental marathons.",
      "This session is a gift to your future self.",
      "Time to turn down the noise and turn up the progress.",
      "You're choosing creation over consumption.",
      "Your attention is a spotlight. Point it wisely.",
      "This is your arena. Time to perform.",
      "Focus is saying no to everything else right now.",
      "You're building your attention muscle.",
      "This is where potential meets execution.",
      "Time to surprise everyone, including yourself.",
      "Your focus is a rebellion against distraction.",
      "This session is a promise kept to yourself.",
      "You're choosing the path of mastery.",
      "Time to show your brain who's boss.",
      "This is your daily victory in the making."
    ],
    "breakTime": [
      "Well done! Rest is part of progress.",
      "You showed up. That's half the battle.",
      "Take a breath. You've earned it.",
      "Breaks make you stronger, not weaker.",
      "Recovery is when growth happens.",
      "You did it! Now recharge.",
      "That was focused work. Be proud.",
      "Your brain needs this. Enjoy it.",
      "Progress made. Battery recharging.",
      "You kept your promise to yourself.",
      "This break is fuel for your next sprint.",
      "Stepping back helps you leap forward.",
      "You're not stopping - you're refueling.",
      "Champions know when to rest.",
      "That focus was impressive. Now restore.",
      "You're learning the rhythm of productivity.",
      "This isn't slacking - it's strategic.",
      "Your mind is processing what you just did.",
      "Breaks prevent burnout. You're being smart.",
      "You just proved you can focus deeply.",
      "Rest proud - you've earned this pause.",
      "Your brain is filing away what you learned.",
      "This break will make your next session stronger.",
      "You're mastering the work-rest cycle.",
      "Sustainable pace wins the race.",
      "You honored your commitment. Honor your rest.",
      "Breaks are where insights happen.",
      "You're not a machine. Rest is human.",
      "This pause is part of your productivity.",
      "You just deposited focus in your success account.",
      "Breaks are bridges to your next achievement.",
      "You're learning to work with your brain, not against it.",
      "This rest is an investment in quality.",
      "You showed up and stayed focused. That's huge.",
      "Your discipline includes knowing when to pause.",
      "This break is your reward for showing up.",
      "You're building sustainable excellence.",
      "Rest is not a luxury - it's a necessity.",
      "You just proved procrastination wrong.",
      "This pause will sharpen your next effort.",
      "You're discovering your optimal rhythm.",
      "Breaks multiply your productivity.",
      "You kept your word. That builds self-trust.",
      "This isn't time off - it's time for integration.",
      "You're learning the art of strategic recovery.",
      "Your focus muscle needs this recovery time.",
      "You just won a battle against distraction.",
      "This break is part of your success system.",
      "You're building habits that last.",
      "Rest confident - you've made progress."
    ]
  },
  "tips": {
    "productivity": [
      "Break large tasks into 2-minute actions to overcome starting resistance.",
      "Use the 'two-minute rule': if it takes less than 2 minutes, do it now.",
      "Your environment shapes your behavior. Remove distractions before you start.",
      "Write down your single most important task before starting.",
      "The Pomodoro Technique works because it makes time finite and manageable.",
      "Task-switching costs you 23 minutes of focus. Stay with one task.",
      "Your phone is the enemy of deep work. Put it in another room.",
      "Morning hours are cognitively prime time for most people. Protect them.",
      "Batch similar tasks together to maintain mental context.",
      "Say 'no' to good opportunities to say 'yes' to great ones.",
      "Energy management is more important than time management.",
      "Work expands to fill the time available. Set artificial deadlines.",
      "The best productivity app is airplane mode.",
      "Perfectionism is procrastination in disguise.",
      "Done is better than perfect. You can always iterate.",
      "Your attention span is a muscle. Train it with focused sessions.",
      "Multitasking is a myth. You're just switching between tasks poorly.",
      "Decision fatigue is real. Reduce daily decisions to save mental energy.",
      "The five-minute rule: commit to just five minutes to overcome inertia.",
      "Your peak hours are limited. Save routine tasks for low-energy times.",
      "Create a shutdown ritual to mentally separate work from rest.",
      "Time blocking is more effective than to-do lists.",
      "Parkinson's Law: work expands to fill time. Use it to your advantage.",
      "The 80/20 rule: 20% of your tasks produce 80% of results.",
      "Eliminate before you optimize. Remove unnecessary tasks first.",
      "Use implementation intentions: 'When X happens, I will do Y'.",
      "Your workspace is a productivity tool. Optimize it.",
      "Cognitive load increases throughout the day. Do hard things first.",
      "External accountability dramatically increases follow-through.",
      "Rest is not the absence of work - it's restorative activity."
    ],
    "focus": [
      "Before starting, write down exactly what success looks like for this session.",
      "The quality of your focus determines the quality of your results.",
      "Meditation trains the same mental muscles as deep work.",
      "Your breath is an anchor. Return to it when distracted.",
      "Focus is not about effort - it's about eliminating alternatives.",
      "Create a focus ritual to signal your brain it's time for deep work.",
      "Attention residue from task-switching reduces performance by 40%.",
      "Your environment should make focus the path of least resistance.",
      "Focus is a practice, not a talent. It improves with repetition.",
      "Close all browser tabs not needed for your current task.",
      "Write down distracting thoughts instead of acting on them.",
      "Focus sessions are training for mental endurance.",
      "Your attention is finite. Spend it intentionally.",
      "Background music with lyrics reduces focus for most cognitive tasks.",
      "The first 10 minutes are the hardest. Push through them.",
      "Focus is saying no to everything that isn't the task at hand.",
      "Your phone's mere presence reduces cognitive performance.",
      "Deep work is the superpower of the 21st century.",
      "Focus compounds. Each session makes the next one easier.",
      "Mental clarity comes from external clarity. Clean your workspace.",
      "Single-tasking is the new competitive advantage.",
      "Your focus is worth more than your time.",
      "Boredom is the mental space where creativity happens.",
      "Focus is not about working harder - it's about working deeper.",
      "The modern world profits from your distraction. Rebel with focus.",
      "Your focused hours are worth more than distracted days.",
      "Shallow work is satisfying but deep work is fulfilling.",
      "Focus is the ability to say no to yourself.",
      "Your attention is your most precious resource. Guard it.",
      "Deep focus is a form of meditation with outcomes."
    ],
    "procrastination": [
      "Procrastination is not laziness - it's emotional avoidance.",
      "The task is never as bad as the story you tell yourself about it.",
      "Start badly. Bad writing beats no writing every time.",
      "Procrastination is the thief of time and the assassin of opportunity.",
      "You're not procrastinating the task - you're avoiding the feeling.",
      "The pain of starting is always worse than the pain of doing.",
      "Procrastination is a habit, not a personality trait. Habits can change.",
      "Fear of failure is procrastination's best friend. Start imperfectly.",
      "The antidote to procrastination is self-compassion, not self-criticism.",
      "Break the task down until it's so small you can't say no.",
      "Procrastination feeds on ambiguity. Get specific about the next step.",
      "You don't need to feel ready to start. Start to feel ready.",
      "Procrastination is often perfectionism without the effort.",
      "The cost of procrastination compounds daily.",
      "Action is the antidote to anxiety.",
      "Procrastination is choosing short-term comfort over long-term goals.",
      "The task won't get easier tomorrow. You'll just have less time.",
      "Motivation follows action, not the other way around.",
      "Procrastination is a credit card for time - high interest rates.",
      "The first step doesn't have to be perfect, just taken.",
      "You're procrastinating the start, not the whole task.",
      "Procrastination is fear dressed up as relaxation.",
      "The regret of not doing lasts longer than the discomfort of doing.",
      "Start where you are, not where you think you should be.",
      "Procrastination is voting for your past self over your future self.",
      "The task isn't going away. Your time is.",
      "Procrastination is expensive. Pay now or pay more later.",
      "You beat procrastination one small action at a time.",
      "The voice telling you to wait is not your friend.",
      "Procrastination is the gap between intention and action. Close it."
    ],
    "contextual": {
      "taskWithManySteps": "Focus on just the next step. The path reveals itself as you walk.",
      "frequentPausing": "Try shorter 15-minute sessions to build your focus stamina.",
      "longSession": "For tasks over 45 minutes, take a 10-minute break to maintain quality.",
      "afterDistraction": "Distractions happen. What matters is how quickly you refocus.",
      "completedSession": "Write down what you accomplished - it reinforces progress.",
      "stoppedEarly": "Note what stopped you. Patterns help you improve.",
      "morningSession": "Morning focus is gold. You're using your prime cognitive time wisely.",
      "eveningSession": "Evening sessions need more structure. Set a clear, specific goal.",
      "firstSession": "Your first session sets the tone for the day. Make it count.",
      "afterBreak": "Post-break is perfect for tasks requiring fresh perspective.",
      "struggling": "If you're stuck, try explaining the problem out loud to yourself.",
      "momentum": "You're in the zone. Ride this wave as long as it lasts.",
      "consistency": "Showing up daily is more important than occasional perfection.",
      "beforeDifficultTask": "Difficult tasks become easier when you start with the smallest part.",
      "avoidance": "The task you're avoiding is usually the one you need to do most.",
      "lowEnergy": "Low energy? Perfect time for routine or administrative tasks.",
      "highEnergy": "High energy is rare. Use it for your most important work.",
      "overwhelmed": "Feeling overwhelmed is a signal to break things down further.",
      "unmotivated": "Motivation is unreliable. Discipline is what gets things done.",
      "stressed": "Stress means you care. Channel it into focused action."
    }
  },
  "config": {
    "rotationStrategy": "random",
    "preventRepeats": true,
    "repeatBuffer": 20,
    "defaultCategory": "motivationalLines",
    "contextualEnabled": true
  }
}